@echo off 
SETLOCAL ENABLEDELAYEDEXPANSION
FOR /F "eol= TOKENS=*" %%i IN ('more +60 "%~f0"') DO (SET /A h+=1 & SET r!h!=%%i)
SET /A s=%RANDOM%%%%h%+1
length "!r%s%!"
set /a ESX=%errorlevel%+1
set /a ESXS=%errorlevel%+6
set /a ESXSX=%errorlevel%+10
modes 1
if %errorlevel% LSS %ESXSX% modes -1 -1 %ESXSX% 15
printf 0x07 "  ┌"
printf -n 0x07 %ESX% ─
echo;┐
echo;  │ !r%s%!│
printf 0x07 "  └"
printf -n 0x07 %ESX% ─
echo;┘
echo;
gotoxy 0 0
set /a gotoxy_x=%errorlevel%-4
set /a gotoxy_y=%errorlevel%-2
call :fechos 2 %gotoxy_x% %ESXS% %gotoxy_y% F0
goto :eof

:fechos <sx> <sy> <ex> <ey> <color>
set /a length=%3 - %1
set /a lengths=%length%+%1
echos -f %5 %length% %1 %2
set /a two=%2+1
for /l %%i in (%two%,1,%4) do (
	echos -f %5 %length% %1 %%i
	echos -f 80 2 %lengths% %%i
)
set /a four=%4+1
set /a ex=%1+2
%6 echos -f 80 %length% %ex% %four%
exit /b 

REM length "!r%s%!"
REM set /a ESX=%errorlevel%+1
REM set /a ESXS=%errorlevel%+4
REM set /a ESXSX=%errorlevel%+7
REM modes 1
REM if %errorlevel% LSS %ESXSX% modes %ESXSX% 15
REM printf 0xf0 "┌"
REM printf -n 0xf0 %ESX% "─"
REM echos 0xf0 "┐"
REM printf 0xf0 "│ !r%s%!│ " & printf -n 0x80 2 " "
REM echo;
REM printf 0xf0 "└"
REM printf -n 0xf0 %ESX% "─"
REM printf 0xf0 "┘ " & printf -n 0x80 2 " "
REM echo;  
REM printf 0x07 "  "
REM printf -n 0x80 %ESXS% " "





海内存知己，天涯若比邻。——王勃

对酒已成千里客，望山空寄西乡心。——卢纶

唯将终夜长开眼，报答平生未展眉。——《遣悲怀三首其三》

死生契阔，与子成说。执子之手，与子偕老。——《诗经·邶风》

十年生死两茫茫。不思量，自难忘，相顾无言，惟有泪千行。——苏轼《江城子》

只缘感君一回顾，使我思君朝与暮。——《汉乐府》

只身千里客，孤枕一灯秋。——陆游

直道相思了无益，未妨惆怅是清狂。——李商隐《无题》

山有木兮木有枝，心悦君兮君不知。——《越人歌》

天涯地角有穷时，只有相思无尽处。——晏殊《玉楼春》

人生自是有情痴，此恨不关风与月。——欧阳修《玉楼春》

万里云帆何时到？送孤鸿，目断千山阻。——叶梦得

花红易衰似郎意，水流无限似侬愁。——《竹枝词四首其二》

无奈归心，暗随流水到天涯。——秦观

岂不尔思，远莫致之。女子有行，远父母兄弟。——《诗经·卫风》

人如风后入江云，情似雨馀黏地絮。——周邦彦《玉楼春》

落花人独立，微雨燕双飞。当时明月在，曾照彩云归。——晏几道《临江仙》

可怜无定河边骨，犹是春闺梦里人。——陈陶《陇西行》

凭杖飞魂招楚些，我思君处君思我。——苏轼《蝶恋花》

凄凉别后两应同，最是不胜清怨月明中。——纳兰性德《虞美人》

独思一夜情多少，地角天涯不是长。——张仲素《燕子楼》

为君沉醉又何妨，只怕酒醒时候断人肠。——秦观《虞美人》

入我相思门，知我相思苦，长相思兮长相忆，短相思兮无穷极。——李白

莫道弦歌愁远滴，青山明月不曾空。——王昌龄

昨夜西风凋碧树，独上高楼，望尽天涯路。欲寄彩笺兼尺素，山长水阔知何处。——晏殊《蝶恋花》

上邪，我欲与君相知，长命无绝衰。山无棱，江水为竭，冬雷震震，夏雨雪，天地合，乃敢与君绝。——《汉乐府》

千里稻花应秀色，五更桐叶最佳音。——曾几

多情只有春庭月，犹为离人照落花。——张泌《寄人》

瘦影自怜秋水照，卿须怜我我怜卿。——《怨》

平生不会相思，才会相思，便害相思。——徐再思《折桂令》

寻好梦，梦难成。况谁知我此时情。(www.lz13.cn)枕前泪共帘前雨，隔个窗儿滴到明。——《鹧鸪天》

玲珑骰子安红豆，入骨相思知不知？——温庭筠《杨柳枝》

海上生明月，天涯共此时。——张九龄

无情不似多情苦，一寸还成千万缕。——晏殊《玉楼春》

醉后不知天在水，满船清梦压星河。——唐温如

有美人兮，见之不忘，一日不见兮，思之如狂。——《凤求凰·琴歌》

身无彩凤双飞翼，心有灵犀一点通。——李商隐《无题》

只愿君心似我心，定不负相思意。——李之仪《卜算子》

落花人独立，微雨燕双飞。——晏几道《临江仙二首其二》

千金纵买相如赋，脉脉此情谁诉。——辛弃疾

一登楼，便作春江都是泪，流不尽，许多愁。——秦观《江城子》

嫦娥应悔偷灵药，碧海青天夜夜心。——李商隐《嫦娥》

都道是金玉良缘，俺只念木石前盟。空对着，山中高士晶莹雪；终不忘，世外仙姝寂寞林。——《终身误》

乱山千叠横江，忆君游倦何方。知否小窗红烛，照人此夜凄凉。——纳兰性德《清平乐》

又到旧时明月路，袖口香寒，心比秋莲苦。——纳兰性德《蝶恋花》

他生莫作有情痴，人间无地着相思。——况周颐《减字浣溪沙》

伤心桥下春波绿，曾是惊鸿照影来。——陆游《沈园》

回廊一寸相思地，落月成孤倚。背灯和月就花阴，已是十年踪迹十年心。——纳兰性德《虞美人》

关关雎鸠，在河之洲。窈宨淑女，君子好逑。——佚名《诗经周南关雎》
文章千古事,得失寸心知——唐.杜甫《偶题》

一日不作诗,心源如废井——唐.贾岛《戏赠友人》

作诗火急追亡逋,情景一失后难摹——宋.苏轼《腊日游孤山访惠勒思二僧》

文章自得方为贵,衣钵相传岂是真——金.王若虚《论诗诗》

我手写我口,古岂能拘牵——清.黄遵宪《杂感》

纵横正有凌云笔,俯仰随人亦可怜——金.元好问《论诗三十首》

须教自我胸中出,切忌随人脚后行——宋.戴复古《论诗十绝》

天籁自鸣天趣足,好诗不过近人情——清.张问陶《论诗十二绝句》

春江秋月冬冰雪,不听陈言只听天——宋.杨万里《读张文潜诗》

莫将死句入诗中,此诀传来自放翁——清.袁枚《仿元遗山论诗》

一语天然万古新,豪华落尽见真淳——金.元好问《论诗三十首》

预支五百年新意,到了千年又觉陈——清.赵翼《论诗五绝》

不求好句,只求好意——宋.欧阳修《吊僧诗》

天机云锦用在我,剪裁妙处非刀尺——宋.陆游《九月一日夜读诗稿有感走笔作歌》

片言可以明百意,坐驰可以役万里——唐.刘禹锡《董氏武陵集记》

清水出芙蓉,天然去雕饰——唐.李白《忆旧游书怀赠江夏韦太守良宰》

不薄今人爱古人,清词丽句必为邻——唐.杜甫《戏为六绝句》

二句三年得,一吟双泪流——唐.贾岛《题诗后》

吟安一个字,拈断数茎须——唐.卢延让《苦吟》

为人性僻耽佳句,语不惊人死不休——唐.杜甫《江上值水如海势聊短述》

爱好由来落笔难,一诗千改始心安——清.袁枚《遣兴》

奇文共欣赏,疑义相与析——晋.陶渊明《移居二首》

论文期摘瑕,求友惟攻阙——清.黎志远《汉阳舟次》

读书破万卷,下笔如有神——唐.杜甫《奉赠韦左丞丈二十二韵》

屈平词赋悬日月,楚王台谢空山丘——唐.李白《江上吟》

李杜文章在,光焰万丈长——唐.韩愈《调张籍》

杜诗韩集愁来读,似倩麻姑痒处抓——唐.杜牧《读韩杜集》

汝果欲学诗,工夫在诗外——宋.陆游《冬夜读书示子聿》

它山之石,可以攻玉——《诗经.鹤鸣》

瓜田不纳履,李下不正冠——汉乐府民歌《君子行》

城中好高髻,四方高一尺——汉乐府民歌《城中谣》

何意百炼钢,化为绕指柔——晋.刘琨《重赠卢谌》

欲穷千里目,更上一层楼——唐.王之焕《登鹳雀楼》

人事有代谢,往事成古今——唐.孟浩然《与诸子登岘山》

草木本无意,荣枯自有时——唐.孟浩然《江上寄山阴崔少府国辅》

春种一粒粟,秋收万颗子——唐.李绅《悯农》

蚍蜉撼大树,可笑不自量——唐.韩愈《调张籍》

挽弓当挽强,用箭当用长.射人先射马,擒贼先擒王------唐.杜甫《前出塞九首》

物情无巨细,自适固其常——唐.杜甫《夏夜叹》

春花无数,毕竟何如秋实——宋.陈亮《三都乐》

功高成怨府,权盛是危机——宋.王迈《读渡江诸将传》

万物兴歇皆自然——唐.李白《日出行》

天若有情天亦老——唐.李贺《金铜仙人辞汉歌》

一寸光阴一寸金——唐.王贞白《白鹿洞二首》

人生七十古来稀——唐.杜甫《曲江》

山外青山楼外楼——宋.林升《题临安邸》

古来青史谁不见,今见功名胜古人——唐.岑参《轮台歌奉送封大夫出师西征》

年年岁岁花相似,岁岁年年人不同——唐.刘希夷《代悲白头翁》

寅父犹能畏后生,丈夫未可轻少年——唐.李白《上李邕》

假金方用真金镀,若是真金不镀金——唐.李绅《答章孝标》

沉舟侧畔千帆过,病树前头万木春——唐.刘禹锡《酬乐天扬州初逢席上见赠》

请君莫奏前朝曲,听唱新翻杨柳枝——唐.刘禹锡《杨柳枝词》

芳林新叶催陈叶,流水前波让后波——唐.刘禹锡《乐天见示伤微之敦诗晦叔三君子皆有深分因成是诗以寄》

采得百花成蜜后,为谁辛苦为谁甜——唐.罗隐《蜂》

尔曹身为名俱灭,不废江河万古流——唐.杜甫《戏为六绝句》

只看后浪催前浪,当悟新人胜旧人——宋.释文向《过苕溪》

不畏浮云遮望眼,只缘身在最高层——宋.王安石《登飞来峰》

不识庐山真面目,只缘身在此山中——宋.苏轼《题西林壁》

不是一番梅彻骨,怎得梅花扑鼻香——元.高明《琵琶记》

纸上得来终觉浅,绝知此事要躬行——宋.陆游《冬夜读书示子聿》

近水楼台先得月,向阳花木易为春——宋.苏麟《断句》

人生到处知何似,应似飞鸿踏雪泥.泥上偶然留指爪,鸿飞那复计东西. ——宋.苏轼《和子由渑池怀旧》

人有悲欢离合,月有阴晴圆缺,此事古难全——宋.苏轼《水调歌头》

一湾死水全无浪,也有春风摆动时——元.戴善夫《陶学士醉写风光好杂剧》

从来好事天生俭,自古瓜儿苦后甜——元.白朴《阳春曲.题情》

苍龙日暮还行雨,老树春深更著花——明.顾炎武《又酬傅处士次韵》

江山代有才人出,各领风骚数百年——清.赵翼《论诗》

辜负枕前云雨，尊前花月。——张元干《石州慢·寒水依痕》

似花还似非花，也无人惜从教坠。——苏轼《水龙吟·次韵章质夫杨花词》

回头满眼凄凉事，秋月春风岂得知。——晏几道《鹧鸪天·斗鸭池南夜不归》

诚知此恨人人有，贫贱夫妻百事哀。——元稹《遣悲怀三首·其二》

不茶不饭，不言不语，一味供他憔悴。——蜀妓《鹊桥仙·说盟说誓》

问世间，情是何物，直教生死相许。——元好问《摸鱼儿二首其一》

丹阳城南秋海阴，丹阳城北楚云深。——王昌龄《芙蓉楼送辛渐二首》

但见宵从海上来，宁知晓向云间没。——李白《把酒问月·故人贾淳令予问之》

碧云红雨小楼空，春光已到销魂处。——张翥《踏莎行·芳草平沙》

射人先射马，擒贼先擒王。——杜甫《前出塞九首·其六》

风驱急雨洒高城，云压轻雷殷地声。——刘基《五月十九日大雨》

独行独语曲江头，回马迟迟上乐游。——白居易《立秋日登乐游园》

侯门一入深如海，从此萧郎是路人。——崔郊《赠去婢》

枫树夜猿愁自断，女萝山鬼语相邀。——李商隐《楚宫》

此时瞻白兔，直欲数秋毫。——杜甫《八月十五夜月二首》

别君去兮何时还？且放白鹿青崖间。须行即骑访名山。——李白《梦游天姥吟留别/别东鲁诸公》

邂逅淇南，岁寒独在，故人襟抱。——王恽《水龙吟·送焦和之赴西夏行省》

沧海月明珠有泪，蓝田日暖玉生烟。——李商隐《锦瑟》

烽火城西百尺楼，黄昏独上海风秋。——王昌龄《从军行七首》

留我酒一樽，前山看春雨。——杜牧《题宣州开元寺（寺置于东晋时）》

过眼年华，动人幽意，相逢几番春换。——王沂孙《法曲献仙音·聚景亭梅次草窗韵》

合欢桃核终堪恨，里许元来别有人。——温庭筠《南歌子词二首/新添声杨柳枝词》

漠漠萧萧，香冻梨花雨。——吴大有《点绛唇·送李琴泉》

芙蓉不及美人妆，水殿风来珠翠香。——王昌龄《西宫秋怨》

江流天地外，山色有无中。——王维《汉江临泛/汉江临眺》

山川萧条极边土，胡骑凭陵杂风雨。——高适《燕歌行》

莫愁前路无知己，天下谁人不识君。——高适《别董大二首》

清景难逢宜爱惜，白头相劝强欢娱。——白居易《八月十五日夜同诸客玩月》

二十二淮南秋雨夜，高斋闻雁来。——韦应物《闻雁》

宝奁明月不欺人，明日归来君试看。——严仁《玉楼春·春思》

田中读书慕尧舜，坐待四海升平年。——高启《练圻老人农隐》

村北村南，谷雨才耕遍。——范成大《蝶恋花·春涨一篙添水面》

漫漫平湖接远天，濛濛细雨湿轻烟。——楼钥《春雨》

一城秋雨豆花凉，闲倚平山望。——张可久《小桃红》

当日佳期鹊误传，至今犹作断肠仙。——晏几道《七夕》

如何肯到清秋日，已带斜阳又带蝉。——李商隐《柳》

萧萧春雨密还疏，景象三时固不如。——李建勋《春雨二首》

离多最是，东西流水，终解两相逢。——晏几道《少年游·离多最是》

郴江幸自绕郴山，为谁流下潇湘去。——秦观《踏莎行》

昨夜圆非今夜圆，却疑圆处减婵娟。——李建枢《咏月》

海畔尖山似剑铓，秋来处处割愁肠。——柳宗元《与浩初上人同看山寄京华亲故》

还卿一钵无情泪，恨不相逢未剃时。——苏曼珠《本事诗》

河上望丛祠，庙前春雨来时。——温庭筠《河渎神·河上望丛祠》

庐山烟雨浙江潮，未至千般恨不消。——苏轼《庐山烟雨浙江潮》

蜀江水碧蜀山青，圣主朝朝暮暮情。——白居易《长恨歌》

青山飞起不压物，野水流来欲湿人。——牛殳《琵琶行》

从别后，忆相逢，几回魂梦与君同。——晏几道《鹧鸪天三首其一》

江帆几片疾如箭，山泉千尺飞如电。——周德清《塞鸿秋·浔阳即景》

花红易衰似郎意，水流无限似侬愁。——刘禹锡《竹枝词四首其二》

莫怪独吟秋思苦，比君校近二毛年。——白居易《秋雨中赠元九》

共眠一舸听秋雨，小簟轻衾各自寒。——朱彝尊《桂殿秋·思往事》

清霜早晚至，何草能不黄？——范成大《秋芸有春绿》

美人赠我锦绣段，何以报之青玉案。——张衡《四愁诗》

昭君拂玉鞍，上马啼红颊。——李白《王昭君二首/王昭君》

还始觉留情缘眼，宽带因春。——吴文英《渡江云三犯·西湖清明》

问世间情为何物，直教生死相许。——元好问《摸鱼儿》

雨声飕飕催早寒，胡雁翅湿高飞难。——杜甫《秋雨叹》

一声画角谯门，丰庭新月黄昏，雪里山前水滨。——白朴《天净沙·冬》

相思已是不曾闲，又那得、工夫咒你。——蜀妓《鹊桥仙·说盟说誓》

怀春情不断，犹带相思旧子。——吴文英《丁香结·夷则商秋日海棠》

思了无益，悔当初相见。——朱彝尊《忆少年·飞花时节》

红叶黄花秋意晚，千里念行客。——晏几道《思远人·红叶黄花秋意晚》

江城如画里，山晚望晴空。——李白《秋登宣城谢脁北楼》

风萧萧兮易水寒，壮士一去兮不复还。——《荆轲歌/渡易水歌》

终日两相思，为君憔悴尽，百花时。——温庭筠《南歌子四首其二》

三冬暂就儒生学，千耦还从父老耕。——陆游《观村童戏溪上》

裛露珠晖冷，凌霜桂影寒。——骆宾王《秋晨同淄川毛司马秋九咏·秋月》

名播兰簪妃后里，晕生莲脸君王侧。——王清惠《满江红·题南京夷山驿》

适与野情惬，千山高复低。——梅尧臣《鲁山山行》

昔看黄菊与君别，今听玄蝉我却回。——刘禹锡《始闻秋风》

秋芸有春绿，疏篱照孤芳。——范成大《秋芸有春绿》

水晶帘动微风起，满架蔷薇一院香。——高骈《山亭夏日》

相逢不语，一朵芙蓉著秋雨。——纳兰容若《减字木兰花·相逢不语》

知君用心如日月，事夫誓拟同生死。——张籍《节妇吟·寄东平李司空师道》

金井梧桐秋叶黄，珠帘不卷夜来霜。——王昌龄《长信怨》

日长篱落无人过，惟有蜻蜓蛱蝶飞。——范成大《四时田园杂兴·其

天外黑风吹海立，浙东飞雨过江来。——苏轼《有美堂暴雨》

黑云压城城欲摧，甲光向日金鳞开。——李贺《雁门太守行》

泪纵能乾终有迹，语多难寄反无词。——陈端生《寄外》

日斜江上孤帆影，草绿湖南万里情。——刘长卿《别严士元》

昨日邻家乞新火，晓窗分与读书灯。——王禹偁《清明》

木落雁南渡，北风江上寒。——孟浩然《早寒江上有怀》

织锦相思楼影下，钿钗暗约小帘间。——吴文英《新雁过妆楼·中秋后一夕李方庵月庭延客命小妓过新水令坐间赋词》

人人解说悲秋事，不似诗人彻底知。——陆游《秋夜》

断虹霁雨，净秋空，山染修眉新绿。——黄庭坚《念奴娇·断虹霁雨》

君恩好似三春雨，半为开花半落花。——潘纬《汉宫词》

胭脂洗出秋阶影，冰雪招来露砌魂。——曹雪芹《薛宝钗咏白海棠》

感君缠绵意，系在红罗襦。——张籍《节妇吟寄东平李司空师道》

玲珑骰子安红豆，入骨相思知不知。——温庭筠《新添声杨柳枝词》

况屈指中秋，十分好月，不照人圆。——辛弃疾《木兰花慢·滁州送范倅》

自来积毁骨能销，何况真红一点臂砂娇。——王国维《虞美人》

移舟水溅差差绿，倚槛风摆柄柄香。——郑谷《莲叶》

芭蕉得雨便怅然，终夜出声清更妍。——杨万里《芭蕉雨》

秋娘渡与泰娘桥，风又飘飘，雨又萧萧。——蒋捷《一剪梅·舟过吴江》

念佳人、音尘别后，对此应解相思。——晁端礼《绿头鸭·咏月》

垂地寒云吞大漠，过江春雨入全吴。——方干《水墨松石》

谁家秋院无风入？何处秋窗无雨声？——曹雪芹《代别离·秋窗风雨夕》

梦也不分明，远山云乱横。——徐灿《菩萨蛮·秋闺》

妆罢低声问夫婿，画眉深浅入时无？——朱庆馀《近试上张水部》

驿亭幽绝堪垂钓，岩石虚明可读书。——欧阳修《咏零陵》

君知妾有夫，赠妾双明珠。——张籍《节妇吟·寄东平李司空师道》

无情明月，有情归梦，同到幽闺。——刘基《眼儿媚·秋思》

金鸭香消欲断魂，梨花春雨掩重门。——戴叔伦《春怨》

八月湖水平，涵虚混太清。——孟浩然《望洞庭湖赠张丞相/临洞庭》

春去秋来也，愁心似醉醺。——欧阳炯《巫山一段云·春去秋来也》

荷蓑出林春雨细，芦管卧吹莎草绿。——李涉《牧童词》

秋雨一向不解休，连昏接晨终穷秋。——梅尧臣《诗句秋雨篇》

闲梦江南梅熟日，夜船吹笛雨萧萧。——皇甫松《梦江南·兰烬落》

宿雨朝来歇，空山秋气清。——李端《茂陵山行陪韦金部》

伤情燕足留红线，恼人鸾影闲团扇。——张可久《塞鸿秋·春情》

抽刀断水水更流，举杯消愁愁更愁。——李白《宣州谢脁楼饯别校书叔云/陪侍御叔华登楼歌》

青山相待，白云相爱，梦不到紫罗袍共黄金带。——宋方壶《山坡羊·道情》

从来幽怨应无数？铁马金戈，青冢黄昏路。——纳兰性德《蝶恋花·出塞》

风雨替花愁。风雨罢，花也应休。——赵秉文《青杏儿·风雨替花愁》

百啭无人能解，因风飞过蔷薇。——黄庭坚《清平乐·春归何处》

寒蝉凄切，对长亭晚，骤雨初歇。——柳永《雨霖铃·寒蝉凄切》

栖霞山裂；沂水陷穴，广数亩。——蒲松龄《地震》

人生自是有情痴，此恨不关风与月。——欧阳修《玉楼春》

千娇面、盈盈伫立，无言有泪，断肠争忍回顾。——柳永《采莲令·月华收》

云白山青万余里，愁看直北是长安。——杜甫《小寒食舟中作》

秋月仍圆夜，江村独老身。——杜甫《十七夜对月》

我歌君起舞，潦倒略相同。——陈师道《除夜对酒赠少章》

楼头残梦五更钟，花底离情三月雨。——晏殊《玉楼春·春恨》

从别后，忆相逢，几回魂梦与君同。——晏几道《鹧鸪天》

去年上巳洛桥边，今年寒食庐山曲。——宋之问《寒食江州满塘驿》

天不老，情难绝。心似双丝网，中有千千结。——张先《千秋岁》

洞房记得初相遇。便只合、长相聚。——柳永《昼夜乐》

春色恼人眠不得，月移花影上栏杆。——王安石《春夜》

故乡今夜思千里，愁鬓明朝又一年。——高適《除夜作》

昨夜风兼雨，帘帏飒飒秋声。——李煜《乌夜啼·昨夜风兼雨》

相逢意气为君饮，系马高楼垂柳边。——王维《少年行四首》

衣带渐宽终不悔，为伊消得人憔悴。——柳永《蝶恋花·伫倚危楼风细细》

泉眼无声惜细流，树阴照水爱晴柔。——杨万里《小池》

玉露凋伤枫树林，巫山巫峡气萧森。——杜甫《秋兴八首·其一》

丝缫细雨沾衣润，刀剪良苗出水齐。——查慎行《自湘东驿遵陆至芦溪》

雁来音信无凭，路遥归梦难成。——李煜《清平乐·别来春半》

平明忽见溪流急，知是他山落雨来。——翁卷《山雨》

人到情多情转薄，而今真个不多情。——纳兰性德《山花子·风絮飘残已化萍》

平生不会相思，才会相思，便害相思。——徐再思《蟾宫曲·春情》

时维九月，序属三秋。——王勃《秋日登洪府膝王阁饯别序》

相逢不语，一朵芙蓉著秋雨。——纳兰性德《减字木兰花·相逢不语》

秋月朗朗关山上，山中行人马蹄响。——张籍《关山月》

一晌凭栏人不见，鲛绡掩泪思量遍。——冯延巳《鹊踏枝·梅落繁枝千万片》

故里千里楚云外，归雁一声烟雨中。——司马扎《白马津阻雨》

云低春雨后，风细暮钟时。——李咸用《送进士刘松》

思君如明烛，煎心且衔泪。——陈叔达《自君之出矣》

从别後，忆相逢，几回魂梦与君同。——晏几道《鹧鸪天三首其一》

二月六夜春水生，门前小滩浑欲平。——杜甫《春水生二绝》

目断秋霄落雁，醉来时响空弦。——辛弃疾《木兰花慢·滁州送范倅》

杨柳又如丝，驿桥春雨时。——温庭筠《菩萨蛮·宝函钿雀金鸂鶒》

人心失去就，贼势腾风雨。——李白《赠江夏韦太守良宰》

落花人独立，微雨燕双飞。——晏几道《临江仙二首·其二》

新妆宜面下朱楼，深锁春光一院愁。——刘禹锡《和乐天春词》

园翁莫把秋荷折，因与游鱼盖夕阳。——周密《西塍废园》

冷红叶叶下塘秋。长与行云共一舟。——姜夔《忆王孙·番阳彭氏小楼作》

花间一壶酒，独酌无相亲。——李白《月下独酌四首·其一》

云带雨，浪迎风，钓翁回棹碧湾中。——李珣《南乡子·云带雨》

长信宫中秋月明，昭阳殿下捣衣声。——王昌龄《长信秋词五首》

一寸丹心图报国，两行清泪为思亲。——于谦《立春日感怀》

只愿君心似我心，定不负相思意。——李之仪《卜算子·我住长江头》

李白如今已仙去，月在青天几圆缺？——唐寅《把酒对月歌》

城郭是非秋雨外，江山形胜暮潮来。——方岳《凤凰台》

醉翁之意不在酒，在乎山水之间也。——欧阳修《醉翁亭记》

朗月清风，浓烟暗雨，天教憔悴度芳姿。——李清照《多丽·咏白菊》

昆山玉碎凤凰叫，芙蓉泣露香兰笑。——李贺《李凭箜篌引》

秋雨，秋雨，一半因风吹去。——纳兰性德《如梦令》

垓下美人泣楚歌，定陶美人泣楚舞，真龙亦鼠虎亦鼠。——王象春《书项王庙壁》

青箬笠，绿蓑衣，斜风细雨不须归——张志和《渔歌子》

画船捶鼓催君去。高楼把酒留君住。——《菩萨蛮·画船捶鼓催君去》

年年岁岁花相似，岁岁年年人不同。——刘希夷《代悲白头翁/白头吟/有所思》

况是青春日将暮，桃花乱落如红雨。——李贺《将进酒·琉璃钟》

夜来秋雨后，秋气飒然新。——白居易《雨后秋凉》

冥冥重泉哭不闻，萧萧暮雨人归去。——白居易《寒食野望吟》

秋花惨淡秋草黄，耿耿秋灯秋夜长。——林黛玉《秋窗风雨夕》

休问梁园旧宾客，茂陵秋雨病相如。——李商隐《寄令狐郎中》

一个是阆苑仙葩，一个是美玉无瑕。——曹雪芹《枉凝眉》

行尽江南，不与离人遇。——晏几道《蝶恋花·梦入江南烟水路》

馀姚江上中秋月，自买扁舟一个归。——苏泂《复过二首·远水连山碧四围》

远书归梦两悠悠，只有空床敌素秋。——李商隐《端居》

碧野朱桥当日事，人不见，水空流。——秦观《江城子·西城杨柳弄春柔》

多谢浣纱人未折，雨中留得盖鸳鸯。——郑谷《莲叶》

思君如陇水，长闻呜咽声。——雍裕之《自君之出矣》

奇文共欣赏，疑义相与析。——陶渊明《移居二首》

晴烟漠漠柳毵毵，不那离情酒半酣。——韦庄《古离别》

乌丝阑纸娇红篆，历历春星。——纳兰性德《红窗月·燕归花谢》

窗雨阻佳期，尽日颙然坐。——孙光宪《生查子·窗雨阻佳期》

山田过雨正宜耕，畦塍处处春泉漫。——秦观《踏莎行·晓树啼莺》

千金纵买相如赋，脉脉此情谁诉。——辛弃疾《摸鱼儿·更能消几番风雨》

秋色到空闺，夜扫梧桐叶。——夏完淳《卜算子·秋色到空闺》

相见时难别亦难，东风无力百花残。——李商隐《无题》

那作商人妇，愁水复愁风。——李白《长干行二首》

武帝祠前云欲散，神仙掌上雨初晴。——崔颢《行经华阴》

世人结交须黄金，黄金不多交不深。——张谓《题长安壁主人》

洛阳城里见秋风，欲作家书意万重。——张籍《秋思》

人言落日是天涯，望极天涯不见家。——李觏《乡思》

天涯倦客，山中归路，望断故园心眼。——苏轼《永遇乐·彭城夜宿燕子楼》

妇人依倚子与夫，同居贫贱心亦舒。——张籍《征妇怨》

山抹微云，天连衰草，画角声断谯门。——秦观《满庭芳·山抹微云》

秋晓上莲峰，高蹑倚天青壁。——陆游《好事近·秋晓上莲峰》

妆罢低声问夫婿，画眉深浅入时无。——朱庆馀《近试上张籍水部/近试上张水部/闺意献张水部》

来日绮窗前，寒梅著花未。——王维《杂诗三首/杂咏三首》

微雨如酥，草色遥看近却无。——苏轼《减字木兰花·莺初解语》

别离还有经年客，怅望不如河鼓星。——唐徐凝《七夕》

京口瓜洲一水间，钟山只隔数重山。——王安石《泊船瓜洲》

土膏欲动雨频催，万草千花一饷开。——范成大《春日田园》

前山急雨过溪来，尽洗却、人间暑气。——吴潜《鹊桥仙·扁舟昨泊》

小溪清水平如镜，一叶飞来浪细生。——徐玑《秋行》

十年离乱后，长大一相逢。——李益《喜见外弟又言别》

美人自刎乌江岸，战火曾烧赤壁山，将军空老玉门关。——张可久《卖花声·怀古》

斜阳独倚西楼。遥山恰对帘钩。——晏殊《清平乐·红笺小字》

宦情羁思共凄凄，春半如秋意转迷。——柳宗元《柳州二月榕叶落尽偶题》

高梧百尺夜苍苍，乱扫秋星落晓霜。——郑板桥《咏梧桐》

寒山转苍翠，秋水日潺湲。——王维《辋川闲居赠裴秀才迪》

昨夜风开露井桃，未央前殿月轮高。——《春宫曲》

竹外桃花三两枝，春江水暖鸭先知。——《惠崇春江》

沾衣欲湿杏花雨，吹面不寒杨柳风。——《绝句》

云霞出海曙，梅柳渡江春。——《和晋陵陆丞早春游望》

一庭春色恼人来，满地落花红几片。——《玉楼春》

燕子不归春事晚，一汀烟雨杏花寒。——《苏溪亭》

燕燕飞来，问春在哪里，惟有池汤自碧。——《淡黄柳》

燕草如碧丝，秦桑低绿枝。——《春思》

雪消门外千山绿，花发江边二月。——《春日西湖寄》

喧鸟覆春洲，杂英满芳甸。——《晚登三山还望京邑》

闻道春还未相识，走傍寒梅访消息。——《早春寄王汉》

渭城朝雨浥轻尘，客舍青青柳色新。——《送元二使》

庭前时有东风入，杨柳千条尽向西。——《代春怨》

天街小雨润如酥，草色遥看近却无。——《早春呈水部》

桃花春水渌，水上鸳鸯浴。——《菩萨蛮》

肃肃花絮晚，菲菲红素轻。——《春运》

诗家清景在新春，绿柳才黄半未匀。——《城东早春》

胜日寻芳泗水滨，无边光景一时新。——《春日》

飒飒东风细雨来，芙蓉塘外有轻雷。——《无题》

日出江花红胜火，春来江水绿如蓝。——《忆江南》

人闲桂花落，夜静春山空。——《鸟鸣涧》

人面不知何处去，桃花依旧笑春风。——《题都城南庄》

人间四月芳菲尽，山寺桃花始盛开。——《大林寺桃花》

侵凌雪色还萱草，漏泄春光有柳条。——《腊日》

千里莺啼绿映红，水村山郭酒旗风。——《江南春》

恰似春风相欺得，夜来吹折数枝花。——《绝句漫兴》

满园深浅色，照在绿波中。——《春游曲》

留连戏蝶时时舞，自在娇莺恰恰啼。——《江畔独步》

林花著雨胭脂湿，水荇牵风翠带长。——《曲江对雨》

林花扫更落，径草踏还生《春中喜王九相寻》

两个黄鹂鸣翠柳，一行白鹭上青天。——《绝句》

狂风落尽深红色，绿叶成阴子满。——《叹花》

寄语洛城风日道，明年春色倍还人。——《春日京中》

几处早莺争暖树，谁家新燕啄春泥。——《钱塘湖春行》

忽如一夜春风来，千树万树梨花开。——《白雪歌送武》

红楼隔雨相望冷，珠箔飘邓独自归。——《春雨》

好雨知时节，当春乃发生。——《春夜喜雨》

寒雪梅中尽，春风柳上归。——《宫中行乐词八首》

寒随一夜去，春还五更来。——《应诏赋得除夜》

过春风十里，尽荠麦青青。——《扬州慢》

芳树无人花自落，春山一路鸟空啼。——《春行即兴》

东风随春归，发我枝上花。——《落日忆山中》

等闲识得东风面，万紫千红总是春。——《春日》

春雨断桥人不渡，小舟撑出柳阴来。——《春日游湖上》

春阴垂野草青青，时有幽花一树明。——《淮中晚泊犊》

春晚绿野秀，岩高白云屯。——《入彭蠡湖口》

春色恼人眠不得，月移花影上栏干。——《春夜》

春色满园关不住，一枝红杏出墙来。——《游园不值》

春日迟迟，卉木萋萋。——《诗经·小雅·出车》

春路雨添花，花动一山春色。——《好事近》

春来不觉晓，处处闻啼鸟。——《春晓》

春风春雨花经眼，江北江南水拍天。——《次元明韵寄》

春草如有情，山中尚含绿。——《金门答苏秀才》

迟日江山丽，春风花草香。——《绝句》

池塘生春草，园柳变鸣禽。——《登池上楼》

城上风光莺语乱，城下烟波春拍岸。——《木兰花》

草树知春不久归，百般红紫斗芳菲。——《晚春》

不知细对谁裁出，二月春风似剪刀。——《咏柳》

碧玉妆成一树高，万条垂下绿丝绦。——《咏柳》

白雪却嫌春色晚，故穿庭树作飞花。——《春雪》

二、描写夏天的诗句摘抄大全

自去自来梁上燕，相亲相近水中鸥。——《江村》

竹摇清影罩幽窗，两两时禽噪夕阳。——《即景》

竹深树密虫鸣处，时有微凉不是风。——《夏夜追凉》

月明船笛参差起，风定池莲自在香。——《纳凉》

欲把西湖比西子，淡妆浓抹总相宜。——《饮湖上初晴》

一夜雨声凉到梦，万荷叶上送秋来。——《夏日杂诗》

夜来南风起，小麦覆陇黄。——《观刈麦》

小荷才露尖尖角，早有蜻蜓立上头。——《小池》

微风忽起吹莲叶，青玉盘中泻水银。——《夏雨后题》

松下茅亭五月凉，汀沙云树晚苍苍。——《题稚川山水》

水满有时观下鹭，草深无处不鸣蛙。——《幽居初夏》

水晶帘动微风起，满架蔷薇一院香。——《山亭夏日》

树阴满地日当午，梦觉流莺时一声。——《夏意》

首夏犹清和，芳草亦未歇。——《游赤石进帆海》

深居俯夹城，春去夏犹清。——《晚晴》

糁径杨花铺白毡，点溪荷叶叠青钱。——《绝句漫兴》

日长睡起无情思， 闲看儿童捉柳花。——《初夏午睡起》

晴日暖风生麦气，绿阴幽草胜花时。——《初夏即事》

清江一曲抱村流，长夏江村事亭幽。——《忸村》

南州溽暑醉如酒，隐几熟眠开北牖。——《夏昼偶作》

绿荫不减来时路，添得黄鹂四五声。——《三衢道中》

绿树村边合，青山郭外斜。——《过故人庄》

绿遍山原白满川，子规声里雨如烟。——《乡村四月》

连雨不知春去，一晴方觉夏深。——《喜晴》

昆仑之高有积雪，蓬莱之远常遗寒。——《暑旱苦热》

卷地风来忽吹散，望湖楼下水如天。——《望湖楼醉书》

接天莲叶无穷碧，映日荷花别样红。——《晓出净慈寺》

黄梅时节家家雨，青草池塘处处蛙。——《有约》

荷风送香气，竹露滴清响。——《夏日南亭怀辛大》

更无柳絮因风起，惟有葵花向日倾。——《客中初夏》

纷纷红紫已成尘，布谷声中夏令新。——《初夏绝句》

芳菲歇去何须恨，夏木阳阴正可人。——《三月晦日》

稻花香里说丰年，听取蛙声一片。——《西江月》

懒摇白羽扇，裸袒青林中。——《夏日山中》

纸屏石枕竹方床，手倦抛书午梦长。——《夏日登车》

自古逢秋悲寂寥，我言秋日胜春朝。——《秋词》

只有一枝梧叶，不知多少秋声。——《清平乐》

月落乌啼霜满天，江枫渔火对愁眠。——《枫桥夜泊》

园翁莫把秋荷折，因与游鱼盖夕阳。——《西塍废园》

雨色秋来寒，风严清江爽。——《酬裴侍御对雨感》

银烛秋光冷画屏，轻罗小扇扑流萤。——《秋夕》

一年好景君须记，最是橙黄橘绿时。——《赠刘景文》

信宿渔人还泛泛，清秋燕子故飞飞。——《秋兴·其三》

萧萧远树流林外，一半秋山带夕阳。——《书河上亭壁》

晚趁寒潮渡江去，满林黄叶雁声多。——《江上》

停车座爱枫林晚， 霜叶红于二月花。——《山行》

亭皋木叶下，陇首秋云飞。——《捣衣诗》

迢迢新秋夕，亭亭月将圆。——《戊申岁六月中遇火》

树树皆秋色，山山唯落晖。——《野望》

山抹微云，天粘衰草。——《满庭芳》

山明水净夜来霜，数树深红出浅黄。——《秋词二首》

人烟寒橘柚，秋色老梧桐。——《秋登宣城谢朓北楼》

秋阴不散霜飞晚，留得枯荷听雨声。——《宿骆氏亭寄》

秋声万户竹，寒色五陵松。——《望秦川》

秋景有时飞独鸟，夕阳无事起寒烟。——《孤山寺端上》

秋风萧瑟天气凉，草木摇落露为霜。——《燕歌行》

秋风萧瑟，洪波涌起。——《观沧海》

秋风起兮白云飞，草木黄落兮雁南归。——《秋风辞》

木落雁南度，北风江上寒。——《早寒江上有怀》

绿池落尽红蕖却，落叶犹开最小钱。——《秋凉晚步》

榈庭多落叶，慨然知已秋。——《酬刘柴桑》

枯藤老树昏鸦，小桥流水人家。——《天净沙·秋思》

君问归期未有期，巴山夜雨涨秋池。——《夜雨寄北》

荆溪白石出，天寒红叶稀。——《山中》

金井梧桐秋叶黄，珠帘不卷夜来霜。——《长信秋词》

解落三秋叶，能开二月花。——《风》

渐霜风凄紧，关河冷落，残照当搂。——《八声甘州》

湖光秋月两相和，潭面无风镜未磨。——《望洞庭》

菡萏香销翠叶残，西风愁起绿波间。——《浣溪沙》

寒山转苍翠，秋水日潺湲。——《辋川闲居赠裴秀才迪》

寒城一以眺，平楚正苍然。——《宣城郡内登望》

桂林风景异，秋似洛阳春。——《始安秋日》

孤村落日残霞，轻烟老树寒鸦。——《天净沙·秋》

风定小轩无落叶，青虫相对吐秋丝。——《秋日》

断虹霁雨，净秋空，山染修眉新绿。——《念奴娇》

春花秋月何时了，往事知多少。——《虞美人》

窗含西岭千秋雪，门泊东吴万里船。——《绝句》

长风万里送秋雁，对此可以酣高楼。——《宣州谢眺楼》

草低金城雾，木下玉门风。——《别诗》

碧云天，黄叶地，秋色连波。——《苏幕遮》

八月秋高风怒号，卷我屋上三重茅。——《茅屋为秋风》

A friend is someone with whom you dare to be yourself.朋友就是和ta在一起你可以大胆做自己的人。

All you can do is try your best.Even with those little steps,you’re closer to your goal than you were yesterday我们能做的只是拼尽全力，即使迈出的步子再小也比昨天接近标了。

And when not in luck with the rest of the disaster， is not loyal friend， The quarrels of friends are the opportunities of foes.在幸运时不与人同享，在灾难中不会是忠实的友人， 朋友间的不和，就是敌人进攻的机会。

Because of you, the winter will have a romantic, everything is very warm。因为有你，这个冬天就有了浪漫，一切都很温暖。

Don't let your past dictate who you are, but let it be part of who you will become. 别让过去主宰现在的你，要让这些点滴都成就未来的你。

Don't say you are a procrastinator; really, it's just that the pace of this bloody age is too fast. 别总说自己有拖延症，其实是这个坑爹的时代步伐太快。

Don't spoil what you have by desiring what you have not——别因为贪求那些无法拥有的，而毁掉已经拥有的。

Even in darkness, it is possible to create light.即使在黑暗中，也能创造光明。

Every one is a moon, and has a dark side which he never shows to anybody. 人人都是月亮，都有决不让人知道的阴暗面。

Everyone wants happiness, no one wants pain, but you can't make a rainbow without a little rain. 每个人都想幸福，没人想要痛苦。但是不经历一点点风雨，怎么见得到彩虹呢?

For those who understand me,my explanation is needless,whereas I don't need to explain to those don't understand me. —— 懂我的人不需要我解释，不懂我的人我不需要解释。

Freedom lies in being bold. 自由源于勇敢。 —罗伯特·佛洛斯特

Guys flirt with the dangerous girls， but they don’t bring them home. They marry the good girls.男人喜欢跟坏女孩调情，但不会把她们娶回家，男人只会娶好女孩。

I am ordinary yet unique. ——我很平凡，但我独一无二。

I just need someone who will never abandon me. 我只是需要一个永远不会放弃我的人。

I learned to GIVE not because I have many. But because I know exactly how it feels to have NOTHING. 我学着给予并不是因为我拥有很多，而是因为我清楚地知道一无所有的感受。

I love waking up in the morning and not knowing what's going to happen, or who I'm going to meet, where I'm going to wind up.　 我喜欢早上起来时一切都是未知的，不知会遇见什么人，会有什么样的结局。--《Titanic》

I prefer having your accompanying for life-long time to the short-time tenderness——我要的，不是你一时的温柔，而是你一生的守候。

I want you to be happy. But I want to be the reason. 我想要你幸福，但我希望我是你幸福的原因。

If a man wants you, nothing can keep him away. If he doesn't, nothing can make him stay.-----如果他爱你，没人能妨碍他靠近;如果他忘情，谁也无力阻止他离去。

If the whole world betrays you, I’m gonna betray the whole world for you.如果全世界背叛了你，我愿为你背叛全世界。

If you don't go after what you want, you'll never have it. If you don't ask, the answer is always no. If you don't step forward, you're always in the same place. 不去追逐你所渴求，你将永远不会拥有。不开口问，回答永远是No。不往前走，就将永远停留。

In life divided into two episodes, the first is "hesitance-free", while the second is "regret-free".——若将人生一分为二，前半段叫“不犹豫”，后半段叫“不后悔”。

Let the right one in. Let the old dreams die. Let the wrong ones go.让适合的人走进你的生活吧，让旧梦逝去吧，让不合适的那个离开吧。

Life is sad at times, but it is up to you to make your own life happy. --生活有时是令人沮丧的，但你可以努力让自己的过得开心。

Love is a strange thing. It can make the weakest person strong, the strongest person weak.爱是个奇妙的东西，它可以让最软弱的人变得坚强，让最坚强的人变得软弱。

Love isn't about how to find out the similarities，it's about how to respect the differences. 爱情不是寻找共同点，而是学会尊重不同点…

More haste, less speed. 欲速则不达。

My heart beats for you every day, I am inspired by you every minute,and I worry about you every second.It is wonderfull to have you in my life. —— 每天都为你心跳，每一刻都被你感动，每一秒都为你担心，有你的感觉真好。

Nothing is impossible, the word itself says 'I'm possible'! 一切皆有可能!“不可能”的意思是、“不，可能。”(奥黛丽·赫本)